var arr_func_token = {
	"统计函数":[
		{
			"name": "COUNT()",
			"desc": "此函数返回记录数。"			
		},
		{
			"name": "COUNT(<字段名>)",
			"desc": "此函数返回指定字段的个数。"
		},
		{
			"name": "SUM(<数值型或货币型字段名>)",
			"desc": "此函数返回数字型或货币型字段的合计值。"
		},
		{
			"name": "AVG(<字段名>)",
			"desc": "此函数返回数字型或货币型字段的平均值。"
		},
		{
			"name": "MAX(<字段名>)",
			"desc": "此函数返回数字型或货币型字段的最大值。"
		},
		{
			"name": "MIN(<数值型或货币型字段名>)",
			"desc": "此函数返回数字型或货币型字段的最小值。"
		}								
	],
	"数据（含货币）函数":[
		{
			"name": "FLOOR(<数值表达式>)",
			"desc": "此函数返回不超过表达式数值的最大整数。\
				例如：FLOOR(125.2) 返回结果为：125"
		},
		{
			"name": "ROUND(<数值表达式>,整数)",
			"desc": "此函数返回指定表达式四舍五入到整数部分规定保留的小数点位数的值。\
    		例如：ROUND(125.256,2) 返回结果为：125.26"
		},
		{
			"name": "RAND()",
			"desc": "此函数返回随机数。"
		},
		{
			"name": "ABS(<数值表达式>)",
			"desc": "此函数返回数值表达式的绝对值。\
    		例如：ABS(-125) 返回结果为：125"
		}				
	],
	"日期和时间函数":[
		{
			"name": "YEAR(<日期表达式>)",
			"desc": "此函数返回日期表达式的年份值。\
    		例如：YEAR(#2007.1.28#) 返回结果为：2007"	
		},
		{
			"name": "MONTH(<日期表达式>)",
			"desc": "此函数返回日期表达式的月份值。\
    		例如：MONTH(#2007.1.28#) 返回结果为：1"
		},
		{
			"name": "DAY(<日期表达式>)",
			"desc": "此函数返回日期表达式的天数。\
    		例如：DAY(#2007.1.28#) 返回结果为：28"
		},
		{
			"name": "QUARTER(<日期表达式>)",
			"desc": "此函数返回日期表达式的季度数。\
    		例如：QUARTER(#2007.1.28#) 返回结果为：1"
		},
		{
			"name": "WEEK(<日期表达式>)",
			"desc": "此函数返回日期表达式的星期数。\
    		例如：WEEK(#2007.1.28#) 返回结果为：4"
		},
		{
			"name": "HOUR(<日期表达式>)",
			"desc": "此函数返回日期表达式的星期数。\
    		例如：HOUR(#2007.1.28 09:59:42#) 返回结果为：9"
		},
		{
			"name": "MINUTE(<日期表达式>)",
			"desc": "此函数返回日期表达式的星期数。\
    		例如：MINUTE(#2007.1.28 09:59:42#) 返回结果为：59"
		},
		{
			"name": "SECOND(<日期表达式>)",
			"desc": "此函数返回日期表达式的星期数。\
    		例如：SECOND(#2007.1.28 09:59:42#) 返回结果为：42"
		},
		{
			"name": "THISDATE",
			"desc": "此函数返回当前日期。"
		},
		{
			"name": "YEARBETWEEN(<日期表达式1>,<日期表达式2>)",
			"desc": "此函数返回日期表达式1到日期表达式2的年份。\
    		例如：YEARBETWEEN(#2005.07.03#,#2007.07.28#) 返回结果为：2"
		},
		{
			"name": "MONTHBETWEEN(<日期表达式1>,<日期表达式2>)",
			"desc": "此函数返回日期表达式1到日期表达式2的月份。\
    		例如：MONTHBETWEEN(#2007.01.28#,#2007.07.28#) 返回结果为：6"
		},
		{
			"name": "DAYBETWEEN(<日期表达式1>,<日期表达式2>)",
			"desc": "此函数返回日期表达式1到日期表达式2的天数。\
    		例如：DAYBETWEEN(#2007.01.03#,#2007.01.28#) 返回结果为：25"
		},
		{
			"name": "QUARTERBETWEEN(<日期表达式1>,<日期表达式2>)",
			"desc": "此函数返回日期表达式1到日期表达式2的季度数。\
    		例如：QUARTERBETWEEN(#2007.01.03#,#2007.07.28#) 返回结果为：2"
		},
		{
			"name": "WEEKBETWEEN(<日期表达式1>,<日期表达式2>)",
			"desc": "此函数返回日期表达式1到日期表达式2的周数。\
    		例如：WEEKBETWEEN(#2007.01.03#,#2007.01.28#) 返回结果为：4"
		},
		{
			"name": "HOURBETWEEN(<日期表达式1>,<日期表达式2>)",
			"desc": "此函数返回日期表达式1到日期表达式2的小时数。\
    		例如：HOURBETWEEN(#2007.01.03 09:59:42#,#2007.01.03 10:59:42#) 返回结果为：1"
		},
		{
			"name": "MINUTEBETWEEN(<日期表达式1>,<日期表达式2>)",
			"desc": "此函数返回日期表达式1到日期表达式2的分钟数。\
    		例如：MINUTEBETWEEN(#2007.01.03 09:59:42#,#2007.01.03 10:59:42#) 返回结果为：60"
		},
		{
			"name": "SECONDBETWEEN(<日期表达式1>,<日期表达式2>)",
			"desc": "此函数返回日期表达式1到日期表达式2的秒数。\
    		例如：SECONDBETWEEN(#2007.01.03 09:59:42#,#2007.01.03 10:59:42#) 返回结果为：3600"
		},
		{
			"name": "ADDYEAR(<日期表达式>,整数)",
			"desc": "此函数返回日期表达式增加指定年数后的日期值。\
    		例如：ADDYEAR(#2005.07.03#,2) 返回结果为：#2007.07.03#"
		},
		{
			"name": "ADDMONTH(<日期表达式>,整数)",
			"desc": "此函数返回日期表达式增加指定月数后的日期值。\
    		例如：ADDMONTH(#2007.07.03#,2) 返回结果为：#2007.09.03#"
		},
		{
			"name": "ADDDAY(<日期表达式>,整数)",
			"desc": "此函数返回日期表达式增加指定天数后的日期值。\
    		例如：ADDDAY(#2005.07.03#,2) 返回结果为：#2005.07.05#"
		},
		{
			"name": "ADDQUARTER(<日期表达式>,整数)",
			"desc": "此函数返回日期表达式增加指定季度数后的日期值。\
    		例如：ADDQUARTER(#2007.01.03#,2) 返回结果为：#2007.07.03#"
		},
		{
			"name": "ADDWEEK(<日期表达式>,整数)",
			"desc": "此函数返回日期表达式增加指定周数后的日期值。\
    		例如：ADDWEEK(#2007.01.03#,3) 返回结果为：#2007.01.24#"
		},
		{
			"name": "ADDHOUR(<日期表达式>,整数)",
			"desc": "此函数返回日期表达式增加指定小时数后的日期值。\
    		例如：ADDHOUR(#09:59:42#,1) 返回结果为：#10:59:42#"
		},
		{
			"name": "ADDMINUTE(<日期表达式>,整数)",
			"desc": "此函数返回日期表达式增加指定分数后的日期值。\
    		例如：ADDMINUTE(#09:59:42#,1) 返回结果为：#10:00:42#"
		},
		{
			"name": "ADDSECOND(<日期表达式>,整数)",
			"desc": "此函数返回日期表达式增加指定分数后的日期值。\
    		例如：ADDSECOND(#09:59:42#,1) 返回结果为：#09:59:43#"
		},																																												
	],
	"字符串函数": [
		{
			"name": "CONCAT(<字符串表达式1>,<字符串表达式2>,...,<字符串表达式n>)",
			"desc": "此函数连接两个字符串。\
    		例如：CONCAT(\"abc\",\"def\") 返回结果为：\"abcdef\""
		},
		{
			"name": "TRIM(<字符串表达式>)",
			"desc": 此函数截取字符串表达式左右两边多余空格。\
    		例如：trim(\"  abc  \") 返回结果为：\"abc\"" 
		},
		{
			"name": "LTRIM(<字符串表达式>)",
			"desc": 此函数截取字符串表达式左边多余空格。\
    		例如：LTRIM(\"  abc  \") 返回结果为：\"abc  \"" 
		},
		{
			"name": "RTRIM(<字符串表达式>)",
			"desc": 此函数截取字符串表达式右边多余空格。\
    		例如：RTRIM(\"  abc  \") 返回结果为：\"  abc\"" 
		},
		{
			"name": "SUBSTR(<字符串表达式>,<起始位>,<长度>)",
			"desc": 此函数返回字符串表达式从[起始位]开始共[长度]个字符的子串。\
    		例如：SUBSTR(\"abcd\", 2, 2) 返回结果为：\"bc\"" 
		},
		{
			"name": "STRLEN(<字符串表达式>)",
			"desc": 此函数返回字符串表达式所包含的字符个数。\
    		例如：STRLEN(\"abcd你好\") 返回结果为：6" 
		},
		{
			"name": "LEFT(<字符串表达式>,<长度>)",
			"desc": 此函数返回字符串表达式左边开始共[长度]个字符的子串。\
    		例如：LEFT(\"abcd你好\", 5) 返回结果为：\"abcd你\"" 
		},
		{
			"name": "RIGHT(<字符串表达式>,<长度>)",
			"desc": 此函数返回字符串表达式右边开始共[长度]个字符的子串。\
    		例如：RIGHT(\"abcd你好\", 5) 返回结果为：\"bcd你好\"" 
		},
		{
			"name": "STRPOS(<字符串表达式1>,<字符串表达式2>)",
			"desc": 此函数返回字符串表达式1中首次出现字符串表达式2的位置，字符位置从1开始计数，未搜索到时返回0。\
    		例如：STRPOS(\"abcd你好\", \"bcd\") 返回结果为：1" 
		},
		{
			"name": "REPLACE(<待搜索的字符串表达式>,<待查找的字符串表达式>,<替换用的字符串表达式>)",
			"desc":  此函数返回用替换用的字符串表达式替换待搜索的字符串表达式中出现的所有待查找的字符串表达式。\
    		例如：REPLACE(\"abcdefghicde\",\"cde\",\"xxx\") 返回结果为：abxxxfghixxx" 
		},
		{
			"name": "REG(<字符串表达式>,<正则表达式>)",
			"desc":  此函数返回字符串表达式是否满足正则表达式规则，满足返回1，否则返回0。\
    		例如：REG(\"fo\no\", \"^fo\no$\") 返回结果为：1" 
		},
		{
			"name": "PINYINQUANMA(<字符串表达式>)",
			"desc":  返回<字符串表达式>对应的拼音。\
    		例如：PINYINQUANMA(\"中国\")，返回结果为：zhongguo" 
		},
		{
			"name": "PINYINJIANMA(<字符串表达式>)",
			"desc":  返回<字符串表达式>对应的拼音简称。\
    		例如：PINYINJIANMA(\"中国\")，返回结果为：zg" 
		}																						
	],
	"集合函数":[
		{
			"name": "SET(<表达式1>,<表达式2>,<表达式3>)",
			"desc": "例如：SET(1,2,3,4)，SET(\"abc\",\"cde\",\"efg\"）"	
		}
	],
	"转换函数":[
		{
			"name": "STRTODATATIME(<字符串表达式>)",
			"desc": "字符转日期。"
		},
		{
			"name": "STRTOFLOAT(<字符串表达式>)",
			"desc": "字符转数值。"
		},
		{
			"name": "FLOATTOSTR(<数值表达式>)",
			"desc": "数值转字符。"
		},
		{
			"name": "FLOATTODATATIME(<数值表达式>)",
			"desc": "数值转日期。"
		},
		{
			"name": "DATATIMETOSTR(<日期表达式>)",
			"desc": "日期转字符。"
		}						
	],
	"类型不定函数":[
		{
			"name": "IF THEN [ELSE] END",
			"desc": "例如：IF 商品=\"牛奶\" THEN 0.02 ELSE 0.1 END"
		},
		{
			"name": "CASE IF cexpr1 THEN expr1 IF cexpr2 THEN expr2 [ELSE exprn] END",
			"desc": "例如：CASE IF 商品=\"牛奶\" THEN 0.02\
                 IF 商品=\"面包\" THEN 0.015\
                 IF 商品=\"咖啡\" THEN 0.15\
                 ELSE 0.1 END"
		},
		{
			"name": "GREATER(表达式1,表达式2)",
			"desc": "返回两者中较大者"
		},
		{
			"name": "LESS(表达式1,表达式2)",
			"desc": "返回两者中较小者"
		}				
	],
	"系统函数":[
		{
			"name": "LOGIN_UNIT",
			"desc": "当前单位"
		},
		{
			"name": "LOGIN_USER",
			"desc": "当前用户"
		},
		{
			"name": "LOGIN_DEPT",
			"desc": "当前部门"
		},
		{
			"name": "LOGIN_PRIV",
			"desc": "当前角色"
		},
		{
			"name": "WRITE_DEPT",
			"desc": "制单部门"
		},
		{
			"name": "WRITER",
			"desc": "制单人"
		},
		{
			"name": "WRITE_TIME",
			"desc": "制单时间"
		},
		{
			"name": "SYSDATE",
			"desc": "系统日期"
		},
		{
			"name": "LOGIN_USER_ID",
			"desc": "当前用户ID"
		},
		{
			"name": "LOGIN_DEPT_ID",
			"desc": "当前部门ID"
		},
		{
			"name": "LONG_DEPT_NAME",
			"desc": "长部门名称"
		},
		{
			"name": "LOGIN_OTHER_PRIV",
			"desc": "当前辅助角色"
		},
		{
			"name": "CUR_GEOLOCATION",
			"desc": "返回用户当前所在的地理位置。"
		}		
	],
	"常量":[
		{
			"name": "TRUE",
			"desc": "真"
		},
		{
			"name": "FALSE",
			"desc": "假"
		},
		{
			"name": "NULL",
			"desc": "空"
		},
		{
			"name": "#2007.1.28#",
			"desc": "返回2007年1月28日。"
		},
		{
			"name": "#1.28#",
			"desc": "返回1月28日。"
		},
		{
			"name": "\"张三\"",
			"desc": "返回字符常量张三"
		}
	],
	"算术运算符":[
		{
			"name": "+",
			"desc": "加"
		},
		{
			"name": "-",
			"desc": "减"
		},
		{
			"name": "*",
			"desc": "乘"
		},
		{
			"name": "/",
			"desc": "除"
		},
		{
			"name": "DIV",
			"desc": "整除"
		},
		{
			"name": "MOD",
			"desc": "取余"
		}										
	],
	"关系运算符":[
		{
			"name":"=",
			"desc":"相等比较符"
		},
		{
			"name":"<>",
			"desc":"不等比较符"
		},
		{
			"name":"<",
			"desc":"小于比较符"
		},
		{
			"name":">",
			"desc":"大于比较符"
		},
		{
			"name":"<=",
			"desc":"小于等于比较符"
		},
		{
			"name":">=",
			"desc":"大于等于比较符"
		},
		{
			"name":"LIKE(<表达式>)",
			"desc":"包含比较符"
		},
		{
			"name":"LLIKE(<表达式>)",
			"desc":"左包含比较符"
		},
		{
			"name":"RLIKE(<表达式>)",
			"desc":"右包含比较符"
		},
		{
			"name":"IN(<集合表达式>)",
			"desc":"属于比较符"
		},
		{
			"name":"BETWEEN(<表达式1>,<表达式2>)",
			"desc":"介于两值之间比较符"
		},
		{
			"name":"ISNOTNULL",
			"desc":"有值比较符"
		},
		{
			"name":"ISNULL",
			"desc":"无值比较符"
		}																								
	],
	"逻辑运算符":[
		{
			"name": "AND",
			"desc": "与"
		},
		{
			"name": "OR",
			"desc": "或"
		},
		{
			"name": "NOT",
			"desc": "费"
		},				
	],
	"其他":[
		{
			"name": "()",
			"desc": "括号"
		},
		{
			"name": "//",
			"desc": "注释符"
		},
		{
			"name": ",",
			"desc": "逗号分隔符"
		}
	]
}